Revit 2027 API
FabricationConfiguration.GetSpecificationGUID Method
 Gets the specification GUID by its identifier.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Guid GetSpecificationGUID(
	int specificationId
)
Public Function GetSpecificationGUID (
	specificationId As Integer
) As Guid
public:
Guid GetSpecificationGUID(
	int specificationId
)
member GetSpecificationGUID :
        specificationId : int -> Guid
Parameters
specificationId Int32
 The specification identifier.
Return Value
Guid
 The specification GUID. Returns empty GUID if not found.
See Also
Reference
FabricationConfiguration Class
Autodesk.Revit.DB Namespace